wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
/*!
    \file    gd32h77x_ospi.c
    \brief   OSPI driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_ospi.h"

static void ospi_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_regular_cmd_struct *cmd_struct);

/*!
    \brief      reset the OSPI peripheral  (API_ID: 0x0001U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_deinit(uint32_t ospi_periph)
{
    switch(ospi_periph) {
    case OSPI0:
        /* reset OSPI0 */
        rcu_periph_reset_enable(RCU_OSPI0RST);
        rcu_periph_reset_disable(RCU_OSPI0RST);
        break;
    case OSPI1:
        /* reset OSPI1 */
        rcu_periph_reset_enable(RCU_OSPI1RST);
        rcu_periph_reset_disable(RCU_OSPI1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      initialize the parameters of OSPI struct with default values (API_ID: 0x0002U)
    \param[in]  none
    \param[out] ospi_struct: the initialized struct ospi_parameter_struct pointer
    \retval     none
*/
void ospi_struct_init(ospi_parameter_struct *ospi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure the structure with default value */
        ospi_struct->prescaler          = 2U;
        ospi_struct->sample_shift       = OSPI_SAMPLE_SHIFTING_NONE;
        ospi_struct->fifo_threshold     = OSPI_FIFO_THRESHOLD_4;
        ospi_struct->dual_quad          = OSPI_DUAL_QUAD_MODE_DISABLE;
        ospi_struct->device_size        = OSPI_MESZ_512_MBS;
        ospi_struct->free_clock_run     = OSPI_CLOCK_FREE_RUN_DISABLE;
        ospi_struct->cs_hightime        = OSPI_CS_HIGH_TIME_3_CYCLE;
        ospi_struct->memory_type        = OSPI_MICRON_MODE;
        ospi_struct->delay_hold_cycle   = OSPI_DELAY_HOLD_NONE;
        ospi_struct->delay_block_bypass = OSPI_DELAY_CLOCK_BYPASS_DISABLE;
        ospi_struct->refrate            = 0U;
    }
}

/*!
    \brief      initialize OSPI parameter (API_ID: 0x0003U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                               OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
                  free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_init(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg = 0U;

        /* configure memory type, device size, chip select high time, delay block bypass, free running clock, clock mode */
        reg = OSPI_DCFG0(ospi_periph);

        reg &= ~(OSPI_DCFG0_DTYSEL | OSPI_DCFG0_MESZ | OSPI_DCFG0_CSHC | OSPI_DCFG0_RCKADD |
                 OSPI_DCFG0_RSCKDEN | OSPI_DCFG0_RXSFT | OSPI_DCFG0_FRCK);


        reg |= (ospi_struct->memory_type | ospi_struct->device_size |
                ospi_struct->cs_hightime | ospi_struct->delay_block_bypass);

        OSPI_DCFG0(ospi_periph) = reg;

        /* configure refresh */
        OSPI_DCFG3(ospi_periph) = (OSPI_DCFG3(ospi_periph) & ~OSPI_DCFG3_REFRATE) | ospi_struct->refrate;

