wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
        /* configure FIFO threshold */
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FTL) | ospi_struct->fifo_threshold;

        /* wait till BUSY flag reset */
        while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
        }

        /* configure clock prescaler */
        OSPI_DCFG1(ospi_periph) = (OSPI_DCFG1(ospi_periph) & ~OSPI_DCFG1_PSC) | OSPI_PSC(ospi_struct->prescaler);

        /* configure Dual Quad mode */
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_DQMOD) | ospi_struct->dual_quad;

        /* configure sample shifting and delay hold quarter cycle */
        OSPI_TIMCFG(ospi_periph) = (OSPI_TIMCFG(ospi_periph) & ~(OSPI_TIMCFG_SSAMPLE | OSPI_TIMCFG_DEHQC)) | (ospi_struct->sample_shift |
                                   ospi_struct->delay_hold_cycle);
    }
}

/*!
    \brief      enable OSPI (API_ID: 0x0004U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_OSPIEN;
}

/*!
    \brief      disable OSPI (API_ID: 0x0005U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_OSPIEN);
}

/*!
    \brief      select device (API_ID: 0x0006U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  deviceid: OSPI device select
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DEVICE0_SELECT: OSPI select flash 0
      \arg        OSPI_DEVICE1_SELECT: OSPI select flash 1
    \param[out] none
    \retval     none
*/
void ospi_device_select(uint32_t ospi_periph, uint32_t deviceid)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_DEVS);
    OSPI_CTL(ospi_periph) |= (uint32_t)(deviceid & OSPI_CTL_DEVS);
}

/*!
    \brief      configure device memory type (API_ID: 0x0007U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dtysel: OSPI device type select
                only one parameter can be selected which is shown as below:
      \arg        OSPI_MICRON_MODE: micron mode
      \arg        OSPI_MACRONIX_MODE: micronix mode
      \arg        OSPI_STANDARD_MODE: standard mode
      \arg        OSPI_MACRONIX_RAM_MODE: micronix ram mode
      \arg        OSPI_HYPERBUS_MEMORY_MODE: hyperbus memory mode
      \arg        OSPI_HYPERBUS_REGISTER_MODE: hyperbus register mode
    \param[out] none
    \retval     none
*/
void ospi_device_memory_type_config(uint32_t ospi_periph, uint32_t dtysel)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_RESERVE_MODE);
    OSPI_DCFG0(ospi_periph) |= (uint32_t)(dtysel & OSPI_RESERVE_MODE);
}

/*!
    \brief      configure device memory size (API_ID: 0x0008U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  mesz: device memory size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
      \arg        OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
      \arg        OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
    \param[out] none
    \retval     none
*/
void ospi_device_memory_size_config(uint32_t ospi_periph, uint32_t mesz)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_MESZ);
    OSPI_DCFG0(ospi_periph) |= (uint32_t)(mesz & OSPI_DCFG0_MESZ);
}

/*!
    \brief      select functional mode (API_ID: 0x0009U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  fmod: OSPI functional mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INDIRECT_WRITE: OSPI indirect write mode
      \arg        OSPI_INDIRECT_READ: OSPI indirect read mode
      \arg        OSPI_STATUS_POLLING: OSPI status polling mode
      \arg        OSPI_MEMORY_MAPPED: OSPI memory mapped mode
    \param[out] none
    \retval     none
*/
void ospi_functional_mode_config(uint32_t ospi_periph, uint32_t fmod)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_FMOD);
    OSPI_CTL(ospi_periph) |= (uint32_t)(fmod & OSPI_CTL_FMOD);
}

/*!
    \brief      configure status polling mode (API_ID: 0x000AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  stop: OSPI automatic stop
                only one parameter can be selected which is shown as below:
      \arg        OSPI_AUTOMATIC_STOP_ABORT: status polling mode stop in abort or disable OSPI
      \arg        OSPI_AUTOMATIC_STOP_MATCH: status polling mode stop in match
    \param[in]  mode: OSPI match mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_MATCH_MODE_AND: status polling match mode and
      \arg        OSPI_MATCH_MODE_OR: status polling match mode or
    \param[out] none
    \retval     none
*/
void ospi_status_polling_config(uint32_t ospi_periph, uint32_t stop, uint32_t mode)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~(OSPI_CTL_SPS | OSPI_CTL_SPMOD));
    OSPI_CTL(ospi_periph) |= (uint32_t)((stop & OSPI_CTL_SPS) | (mode & OSPI_CTL_SPMOD));
}

/*!
    \brief      configure status mask (API_ID: 0x000BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  mask: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_status_mask_config(uint32_t ospi_periph, uint32_t mask)
{
    OSPI_STATMK(ospi_periph) &= (uint32_t)(~OSPI_STATMK_MASK);
    OSPI_STATMK(ospi_periph) |= (uint32_t)(mask & OSPI_STATMK_MASK);
}

/*!
    \brief      configure status match (API_ID: 0x000CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  match: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_status_match_config(uint32_t ospi_periph, uint32_t match)
{
    OSPI_STATMATCH(ospi_periph) &= (uint32_t)(~OSPI_STATMATCH_MATCH);
    OSPI_STATMATCH(ospi_periph) |= (uint32_t)(match & OSPI_STATMATCH_MATCH);
}

/*!
    \brief      configure interval cycle (API_ID: 0x000DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  interval: between 0 and 0xFFFF
    \param[out] none
    \retval     none
*/
void ospi_interval_cycle_config(uint32_t ospi_periph, uint16_t interval)
{
    OSPI_INTERVAL(ospi_periph) &= (uint32_t)(~OSPI_INTERVAL_INTERVAL);
    OSPI_INTERVAL(ospi_periph) |= (uint32_t)(interval & OSPI_INTERVAL_INTERVAL);
}

/*!
    \brief      configure timeout period (API_ID: 0x000EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  timeout: between 0 and 0xFFFF
    \param[out] none
    \retval     none
*/
void ospi_timeout_cycle_config(uint32_t ospi_periph, uint16_t timeout)
{
    OSPI_LPOUT(ospi_periph) &= (uint32_t)(~OSPI_LPOUT_TIMEOUT);
    OSPI_LPOUT(ospi_periph) |= (uint32_t)(timeout & OSPI_LPOUT_TIMEOUT);
}

/*!
    \brief      enable OSPI timeout counter (API_ID: 0x000FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_timeout_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_TMOUTEN;
}

/*!
    \brief      disable OSPI timeout counter (API_ID: 0x0010U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_timeout_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_TMOUTEN);
}

/*!
    \brief      enable OSPI dual-quad mode (API_ID: 0x0011U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dual_quad_mode_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_DQMOD;
}

/*!
    \brief      disable OSPI dual-quad mode (API_ID: 0x0012U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dual_quad_mode_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_DQMOD);
}

/*!
    \brief      configure OSPI fifo threshold level (API_ID: 0x0013U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ftl: FIFO threshold level
                only one parameter can be selected which is shown as below:
      \arg        OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
    \param[out] none
    \retval     none
*/
void ospi_fifo_level_config(uint32_t ospi_periph, uint32_t ftl)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_FTL);
    OSPI_CTL(ospi_periph) |= (uint32_t)(ftl & OSPI_CTL_FTL);
}

/*!
    \brief      enable clk free running when OSPI is free (API_ID: 0x0014U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_free_clk_run_enable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) |= (uint32_t)OSPI_DCFG0_FRCK;
}

/*!
    \brief      disable clk free running when OSPI is free (API_ID: 0x0015U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_free_clk_run_disable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_FRCK);
}

/*!
    \brief      configure chip select high cycle (API_ID: 0x0016U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  cshc: OSPI chip select high cycle
                only one parameter can be selected which is shown as below:
      \arg        OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
    \param[out] none
    \retval     none
*/
void ospi_chip_select_high_cycle_config(uint32_t ospi_periph, uint32_t cshc)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_CSHC);
    OSPI_DCFG0(ospi_periph) |= (uint32_t)(cshc & OSPI_DCFG0_CSHC);
}

/*!
    \brief      configure OSPI prescaler (API_ID: 0x0017U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  psc: between 0 and 0xFF
    \param[out] none
    \retval     none
*/
void ospi_prescaler_config(uint32_t ospi_periph, uint32_t psc)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_PSC);
    OSPI_DCFG1(ospi_periph) |= (uint32_t)(psc & OSPI_DCFG1_PSC);
}

/*!
    \brief      configure refresh rate (API_ID: 0x0018U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  refrate: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_refresh_config(uint32_t ospi_periph, uint32_t refrate)
{
    OSPI_DCFG3(ospi_periph) &= (uint32_t)(~OSPI_DCFG3_REFRATE);
    OSPI_DCFG3(ospi_periph) |= (uint32_t)(refrate & OSPI_DCFG3_REFRATE);
}

/*!
    \brief      enable OSPI dqs mode (API_ID: 0x0019U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_mode_enable(uint32_t ospi_periph)
{
    OSPI_TCFG(ospi_periph) |= (uint32_t)OSPI_TCFG_DQSEN;
}

/*!
    \brief      disable OSPI dqs mode (API_ID: 0x001AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_mode_disable(uint32_t ospi_periph)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)(~OSPI_TCFG_DQSEN);
}

/*!
    \brief      send instruction only once mode (API_ID: 0x001BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  sioo: OSPI sioo mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_SIOO_INST_EVERY_CMD: OSPI send instruction on every commmand sequence
      \arg        OSPI_SIOO_INST_ONLY_FIRST_CMD: OSPI send instruction only for the first sequence
    \param[out] none
    \retval     none
*/
void ospi_send_instruction_mode_config(uint32_t ospi_periph, uint32_t sioo)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)(~OSPI_TCFG_SIOO);
    OSPI_TCFG(ospi_periph) |= (uint32_t)(sioo & OSPI_TCFG_SIOO);
}

/*!
    \brief      configure dummy cycles number (API_ID: 0x001CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dumyc: between 0 and 0x1F
    \param[out] none
    \retval     none
*/
void ospi_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc)
{
    OSPI_TIMCFG(ospi_periph) &= (uint32_t)(~OSPI_TIMCFG_DUMYC);
    OSPI_TIMCFG(ospi_periph) |= (uint32_t)(dumyc & OSPI_TIMCFG_DUMYC);
}

/*!
    \brief      delay hold 1/4 cycle (API_ID: 0x001DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dehqc: OSPI delay hold quarter cycle
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DELAY_HOLD_NONE: OSPI no delay hold cycle
      \arg        OSPI_DELAY_HOLD_QUARTER_CYCLE: OSPI delay hold 1/4 cycle
    \param[out] none
    \retval     none
*/
void ospi_delay_hold_cycle_config(uint32_t ospi_periph, uint32_t dehqc)
{
    OSPI_TIMCFG(ospi_periph) &= (uint32_t)(~OSPI_TIMCFG_DEHQC);
    OSPI_TIMCFG(ospi_periph) |= (uint32_t)(dehqc & OSPI_TIMCFG_DEHQC);
}

/*!
    \brief      configure sample shift (API_ID: 0x001EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ssample: OSPI sample shift
                only one parameter can be selected which is shown as below:
      \arg        OSPI_SAMPLE_SHIFTING_NONE: OSPI no sample shift
      \arg        OSPI_SAMPLE_SHIFTING_HALF_CYCLE: OSPI have 1/2 cycle sample shift
    \param[out] none
    \retval     none
*/
void ospi_sample_shift_config(uint32_t ospi_periph, uint32_t ssample)
{
    OSPI_TIMCFG(ospi_periph) &= (uint32_t)(~OSPI_TIMCFG_SSAMPLE);
    OSPI_TIMCFG(ospi_periph) |= (uint32_t)(ssample & OSPI_TIMCFG_SSAMPLE);
}

/*!
    \brief      configure sample shift (API_ID: 0x001FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  sample_shift2: OSPI sample shift2, support use with
                only one parameter can be selected which are shown as below:
      \arg        OSPI_SHIFTING_NONE: no shift when sample data
      \arg        OSPI_SHIFTING_1_CYCLE: 1 sck cycle shift
      \arg        OSPI_SHIFTING_2_CYCLE: 2 sck cycle shift
      \arg        OSPI_SHIFTING_3_CYCLE: 3 sck cycle shift
      \arg        OSPI_SHIFTING_4_CYCLE: 4 sck cycle shift
      \arg        OSPI_SHIFTING_5_CYCLE: 5 sck cycle shift
      \arg        OSPI_SHIFTING_6_CYCLE: 6 sck cycle shift
      \arg        OSPI_SHIFTING_7_CYCLE: 7 sck cycle shift
    \param[out] none
    \retval     none
*/
void ospi_sample_shift2_config(uint32_t ospi_periph, uint32_t sample_shift2)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_RXSFT);
    OSPI_DCFG0(ospi_periph) |= (uint32_t)(sample_shift2 & OSPI_DCFG0_RXSFT);
}

/*!
    \brief      enable OSPI receive delay block (API_ID: 0x0020U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_receive_delay_block_enable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) |= (uint32_t)OSPI_DCFG0_RSCKDEN;
}

/*!
    \brief      disable OSPI receive delay block (API_ID: 0x0021U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_receive_delay_block_disable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_RSCKDEN);
}

/*!
    \brief      enable OSPI csn add 1/2 cycle mode (API_ID: 0x0022U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_csn_add_enable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) |= (uint32_t)OSPI_DCFG1_CSNADD;
}

/*!
    \brief      disable OSPI csn add 1/2 cycle mode (API_ID: 0x0023U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_csn_add_disable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_CSNADD);
}

/*!
    \brief      enable OSPI dqs rck add 1 cycle mode (API_ID: 0x0024U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_rck_add_enable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) |= (uint32_t)OSPI_DCFG0_RCKADD;
}

/*!
    \brief      disable OSPI dqs rck add 1 cycle mode (API_ID: 0x0025U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_rck_add_disable(uint32_t ospi_periph)
{
    OSPI_DCFG0(ospi_periph) &= (uint32_t)(~OSPI_DCFG0_RCKADD);
}

/*!
    \brief      enable OSPI dqs output mode (API_ID: 0x0026U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_output_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_DQSOEN;
}

/*!
    \brief      disable OSPI dqs output mode (API_ID: 0x0027U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_output_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_DQSOEN);
}

/*!
    \brief      OSPI dqs output delay chain (API_ID: 0x0028U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  delay: between 1 and 16
    \param[out] none
    \retval     none
*/
void ospi_dqs_output_delay_chain_config(uint32_t ospi_periph, uint32_t delay)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_DQSODV);
    OSPI_DCFG1(ospi_periph) |= (uint32_t)(((delay - 1U) << 28U) & OSPI_DCFG1_DQSODV);
}

/*!
    \brief      enable OSPI dqs output delay chain (API_ID: 0x0029U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_output_delay_chain_enable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) |= (uint32_t)OSPI_DCFG1_DQSODVEN;
}

/*!
    \brief      disable OSPI dqs output delay chain (API_ID: 0x002AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_dqs_output_delay_chain_disable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_DQSODVEN);
}

/*!
    \brief      OSPI transmit clk delay chain (API_ID: 0x002BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  delay: between 1 and 16
    \param[out] none
    \retval     none
*/
void ospi_tck_delay_chain_config(uint32_t ospi_periph, uint32_t delay)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_TCKDV);
    OSPI_DCFG1(ospi_periph) |= (uint32_t)(((delay - 1U) << 12U) & OSPI_DCFG1_TCKDV);
}

/*!
    \brief      enable OSPI transmit clk delay chain (API_ID: 0x002CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_tck_delay_chain_enable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) |= (uint32_t)OSPI_DCFG1_TCKDVEN;
}

/*!
    \brief      disable OSPI transmit clk delay chain (API_ID: 0x002DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_tck_delay_chain_disable(uint32_t ospi_periph)
{
    OSPI_DCFG1(ospi_periph) &= (uint32_t)(~OSPI_DCFG1_TCKDVEN);
}

/*!
    \brief      OSPI receive clk delay chain (API_ID: 0x002EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  delay: between 1 and 16
    \param[out] none
    \retval     none
*/
void ospi_rck_delay_chain_config(uint32_t ospi_periph, uint32_t delay)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_RCKDV);
    OSPI_CTL(ospi_periph) |= (uint32_t)(((delay - 1U) << 24U) & OSPI_CTL_RCKDV);
}

/*!
    \brief      select OSPI receive sck delay chain (API_ID: 0x002FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_receive_sck_delay_chain_select(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_RCKDVMUX;
}

/*!
    \brief      select CPDM delay (API_ID: 0x0030U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_cpdm_delay_select(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_RCKDVMUX);
}

/*!
    \brief      configure data length (API_ID: 0x0031U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dtlen: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_data_length_config(uint32_t ospi_periph, uint32_t dtlen)
{
    OSPI_DTLEN(ospi_periph) &= (uint32_t)(~OSPI_DTLEN_DTLEN);
    OSPI_DTLEN(ospi_periph) |= (uint32_t)(dtlen & OSPI_DTLEN_DTLEN);
}

/*!
    \brief      configure instruction mode (API_ID: 0x0032U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  imod: OSPI instruction mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_NONE: no instruction mode
      \arg        OSPI_INSTRUCTION_1_LINE: instruction mode on a single line
      \arg        OSPI_INSTRUCTION_2_LINES: instruction mode on two lines
      \arg        OSPI_INSTRUCTION_4_LINES: instruction mode on four lines
      \arg        OSPI_INSTRUCTION_8_LINES: instruction mode on eight lines
    \param[in]  insdtr: OSPI instruction double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSDTR_MODE_DISABLE: instruction double transfer rate mode disable
      \arg        OSPI_INSDTR_MODE_ENABLE: instruction double transfer rate mode enable
    \param[in]  inssz: OSPI instruction size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_8_BITS: instruction size on 8-bit address
      \arg        OSPI_INSTRUCTION_16_BITS: instruction size on 16-bit address
      \arg        OSPI_INSTRUCTION_24_BITS: instruction size on 24-bit address
      \arg        OSPI_INSTRUCTION_32_BITS: instruction size on 32-bit address
    \param[in]  instruction: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_IMOD | OSPI_TCFG_INSSZ | OSPI_TCFG_INSDTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((imod & OSPI_TCFG_IMOD) | (inssz & OSPI_TCFG_INSSZ) | (insdtr & OSPI_TCFG_INSDTR));
    OSPI_INS(ospi_periph) &= (uint32_t)(~OSPI_INS_INSTRUCTION);
    OSPI_INS(ospi_periph) |= (uint32_t)(instruction & OSPI_INS_INSTRUCTION);
}

