wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
/*!
    \brief      configure address mode (API_ID: 0x0033U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  addrmod: OSPI address mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_NONE: no address mode
      \arg        OSPI_ADDRESS_1_LINE: address mode on a single line
      \arg        OSPI_ADDRESS_2_LINES: address mode on two lines
      \arg        OSPI_ADDRESS_4_LINES: address mode on four lines
      \arg        OSPI_ADDRESS_8_LINES: address mode on eight lines
    \param[in]  addrdtr: OSPI address double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRDTR_MODE_DISABLE: address double transfer rate mode disable
      \arg        OSPI_ADDRDTR_MODE_ENABLE: address double transfer rate mode enable
    \param[in]  addrsz: OSPI address size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_8_BITS: address size on 8-bit address
      \arg        OSPI_ADDRESS_16_BITS: address size on 16-bit address
      \arg        OSPI_ADDRESS_24_BITS: address size on 24-bit address
      \arg        OSPI_ADDRESS_32_BITS: address size on 32-bit address
    \param[in]  addr: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_ADDRMOD | OSPI_TCFG_ADDRSZ | OSPI_TCFG_ADDRDTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((addrmod & OSPI_TCFG_ADDRMOD) | (addrsz & OSPI_TCFG_ADDRSZ) | (addrdtr & OSPI_TCFG_ADDRDTR));
    OSPI_ADDR(ospi_periph) &= (uint32_t)(~OSPI_ADDR_ADDR);
    OSPI_ADDR(ospi_periph) |= (uint32_t)(addr & OSPI_ADDR_ADDR);
}

/*!
    \brief      configure alternate bytes mode (API_ID: 0x0034U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_ALTEMOD | OSPI_TCFG_ALTESZ | OSPI_TCFG_ABDTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_TCFG_ALTEMOD) | (altesz & OSPI_TCFG_ALTESZ) | (abdtr & OSPI_TCFG_ABDTR));
    OSPI_ALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_ALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure data mode (API_ID: 0x0035U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_TCFG(ospi_periph) &= (uint32_t)~(OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);
    OSPI_TCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_TCFG_DATAMOD) | (dadtr & OSPI_TCFG_DADTR));
}

/*!
    \brief      OSPI transmit data (API_ID: 0x0036U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  data: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_data_transmit(uint32_t ospi_periph, uint32_t data)
{
    OSPI_DATA(ospi_periph) = (uint32_t)data;
}

/*!
    \brief      OSPI receive data (API_ID: 0x0037U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     between 0 and 0xFFFFFFFF
*/
uint32_t ospi_data_receive(uint32_t ospi_periph)
{
    return ((uint32_t)OSPI_DATA(ospi_periph));
}

/*!
    \brief      enable OSPI MDMA (API_ID: 0x0038U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_mdma_enable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) |= (uint32_t)OSPI_CTL_MDMAEN;
}

/*!
    \brief      disable OSPI MDMA (API_ID: 0x0039U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_mdma_disable(uint32_t ospi_periph)
{
    OSPI_CTL(ospi_periph) &= (uint32_t)(~OSPI_CTL_MDMAEN);
}

/*!
    \brief      abort the current transmission (API_ID: 0x003AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_transmission_abort(uint32_t ospi_periph)
{
    /* check if the MDMA is enabled */
    if(RESET != (OSPI_CTL(ospi_periph) & OSPI_CTL_MDMAEN)) {
        /* disable the MDMA transfer on the OSPI side */
        OSPI_CTL(ospi_periph) &= ~OSPI_CTL_MDMAEN;
    }

    if(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
        /* perform an abort of the OSPI */
        OSPI_CTL(ospi_periph) |= OSPI_CTL_ABORT;

        /* wait until the transfer complete flag is set to go back in idle state */
        while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
        }

        /* clear transfer complete flag */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;

        /* wait until the busy flag is reset to go back in idle state */
        while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
        }
    }
}

/*!
    \brief      abort the current transmission (API_ID: 0x003BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_interrupt_transmission_abort(uint32_t ospi_periph)
{
    /* disable all interrupts */
    OSPI_CTL(ospi_periph) &= ~(OSPI_CTL_TERRIE | OSPI_CTL_TCIE | OSPI_CTL_FTIE | OSPI_CTL_SMIE | OSPI_CTL_TMOUTIE);

