wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
    /* check if the DMA is enabled */
    if(RESET != (OSPI_CTL(ospi_periph) & OSPI_CTL_MDMAEN)) {
        /* disable the DMA transfer on the OctoSPI side */
        OSPI_CTL(ospi_periph) &= ~OSPI_CTL_MDMAEN;
    } else {
        if(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
            /* clear transfer complete flag */
            OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;

            /* enable the transfer complete interrupts */
            OSPI_CTL(ospi_periph) |= OSPI_CTL_TCIE;

            /* perform an abort of the OctoSPI */
            OSPI_CTL(ospi_periph) |= OSPI_CTL_ABORT;
        }
    }
}

/*!
    \brief      configure wrap instruction mode (API_ID: 0x003CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  imod: OSPI instruction mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_NONE: no instruction mode
      \arg        OSPI_INSTRUCTION_1_LINE: instruction mode on a single line
      \arg        OSPI_INSTRUCTION_2_LINES: instruction mode on two lines
      \arg        OSPI_INSTRUCTION_4_LINES: instruction mode on four lines
      \arg        OSPI_INSTRUCTION_8_LINES: instruction mode on eight lines
    \param[in]  insdtr: OSPI instruction double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSDTR_MODE_DISABLE: instruction double transfer rate mode disable
      \arg        OSPI_INSDTR_MODE_ENABLE: instruction double transfer rate mode enable
    \param[in]  inssz: OSPI instruction size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_8_BITS: instruction size on 8-bit address
      \arg        OSPI_INSTRUCTION_16_BITS: instruction size on 16-bit address
      \arg        OSPI_INSTRUCTION_24_BITS: instruction size on 24-bit address
      \arg        OSPI_INSTRUCTION_32_BITS: instruction size on 32-bit address
    \param[in]  instruction: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_IMOD | OSPI_WPTCFG_INSSZ | OSPI_WPTCFG_INSDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((imod & OSPI_WPTCFG_IMOD) | (inssz & OSPI_WPTCFG_INSSZ) | (insdtr & OSPI_WPTCFG_INSDTR));
    OSPI_WPINS(ospi_periph) &= (uint32_t)(~OSPI_INS_INSTRUCTION);
    OSPI_WPINS(ospi_periph) |= (uint32_t)(instruction & OSPI_INS_INSTRUCTION);
}

/*!
    \brief      configure wrap address mode (API_ID: 0x003DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  addrmod: OSPI address mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_NONE: no address mode
      \arg        OSPI_ADDRESS_1_LINE: address mode on a single line
      \arg        OSPI_ADDRESS_2_LINES: address mode on two lines
      \arg        OSPI_ADDRESS_4_LINES: address mode on four lines
      \arg        OSPI_ADDRESS_8_LINES: address mode on eight lines
    \param[in]  addrdtr: OSPI address double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRDTR_MODE_DISABLE: address double transfer rate mode disable
      \arg        OSPI_ADDRDTR_MODE_ENABLE: address double transfer rate mode enable
    \param[in]  addrsz: OSPI address size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_8_BITS: address size on 8-bit address
      \arg        OSPI_ADDRESS_16_BITS: address size on 16-bit address
      \arg        OSPI_ADDRESS_24_BITS: address size on 24-bit address
      \arg        OSPI_ADDRESS_32_BITS: address size on 32-bit address
    \param[in]  addr: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_ADDRMOD | OSPI_WPTCFG_ADDRSZ | OSPI_WPTCFG_ADDRDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((addrmod & OSPI_WPTCFG_ADDRMOD) | (addrsz & OSPI_WPTCFG_ADDRSZ) | (addrdtr & OSPI_WPTCFG_ADDRDTR));
    OSPI_ADDR(ospi_periph) &= (uint32_t)(~OSPI_ADDR_ADDR);
    OSPI_ADDR(ospi_periph) |= (uint32_t)(addr & OSPI_ADDR_ADDR);
}

/*!
    \brief      configure wrap alternate bytes mode (API_ID: 0x003EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_wrap_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_ALTEMOD | OSPI_WPTCFG_ALTESZ | OSPI_WPTCFG_ABDTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_WPTCFG_ALTEMOD) | (altesz & OSPI_WPTCFG_ALTESZ) | (abdtr & OSPI_WPTCFG_ABDTR));
    OSPI_WPALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_WPALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure wrap data mode (API_ID: 0x003FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_wrap_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)~(OSPI_WPTCFG_DATAMOD | OSPI_WPTCFG_DADTR);
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_WPTCFG_DATAMOD) | (dadtr & OSPI_WPTCFG_DADTR));
}

/*!
    \brief      enable OSPI wrap dqs mode (API_ID: 0x0040U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dqs_enable(uint32_t ospi_periph)
{
    OSPI_WPTCFG(ospi_periph) |= (uint32_t)OSPI_WPTCFG_DQSEN;
}

/*!
    \brief      disable OSPI wrap dqs mode (API_ID: 0x0041U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dqs_disable(uint32_t ospi_periph)
{
    OSPI_WPTCFG(ospi_periph) &= (uint32_t)(~OSPI_WPTCFG_DQSEN);
}

/*!
    \brief      configure wrap dummy cycles number (API_ID: 0x0042U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dumyc: number of dummy cycles
      \arg        OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
    \param[out] none
    \retval     none
*/
void ospi_wrap_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc)
{
    OSPI_WPTIMCFG(ospi_periph) &= (uint32_t)(~OSPI_WPTIMCFG_DUMYC);
    OSPI_WPTIMCFG(ospi_periph) |= (uint32_t)(dumyc & OSPI_WPTIMCFG_DUMYC);
}

/*!
    \brief      configure write instruction mode (API_ID: 0x0043U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  imod: OSPI instruction mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_NONE: no instruction mode
      \arg        OSPI_INSTRUCTION_1_LINE: instruction mode on a single line
      \arg        OSPI_INSTRUCTION_2_LINES: instruction mode on two lines
      \arg        OSPI_INSTRUCTION_4_LINES: instruction mode on four lines
      \arg        OSPI_INSTRUCTION_8_LINES: instruction mode on eight lines
    \param[in]  insdtr: OSPI instruction double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSDTR_MODE_DISABLE: instruction double transfer rate mode disable
      \arg        OSPI_INSDTR_MODE_ENABLE: instruction double transfer rate mode enable
    \param[in]  inssz: OSPI instruction size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INSTRUCTION_8_BITS: instruction size on 8-bit address
      \arg        OSPI_INSTRUCTION_16_BITS: instruction size on 16-bit address
      \arg        OSPI_INSTRUCTION_24_BITS: instruction size on 24-bit address
      \arg        OSPI_INSTRUCTION_32_BITS: instruction size on 32-bit address
    \param[in]  instruction: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_instruction_config(uint32_t ospi_periph, uint32_t imod, uint32_t insdtr, uint32_t inssz, uint32_t instruction)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_IMOD | OSPI_WTCFG_INSSZ | OSPI_WTCFG_INSDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((imod & OSPI_WTCFG_IMOD) | (inssz & OSPI_WTCFG_INSSZ) | (insdtr & OSPI_WTCFG_INSDTR));
    OSPI_WINS(ospi_periph) &= (uint32_t)(~OSPI_INS_INSTRUCTION);
    OSPI_WINS(ospi_periph) |= (uint32_t)(instruction & OSPI_INS_INSTRUCTION);
}

/*!
    \brief      configure write address mode (API_ID: 0x0044U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  addrmod: OSPI address mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_NONE: no address mode
      \arg        OSPI_ADDRESS_1_LINE: address mode on a single line
      \arg        OSPI_ADDRESS_2_LINES: address mode on two lines
      \arg        OSPI_ADDRESS_4_LINES: address mode on four lines
      \arg        OSPI_ADDRESS_8_LINES: address mode on eight lines
    \param[in]  addrdtr: OSPI address double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRDTR_MODE_DISABLE: address double transfer rate mode disable
      \arg        OSPI_ADDRDTR_MODE_ENABLE: address double transfer rate mode enable
    \param[in]  addrsz: OSPI address size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ADDRESS_8_BITS: address size on 8-bit address
      \arg        OSPI_ADDRESS_16_BITS: address size on 16-bit address
      \arg        OSPI_ADDRESS_24_BITS: address size on 24-bit address
      \arg        OSPI_ADDRESS_32_BITS: address size on 32-bit address
    \param[in]  addr: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_address_config(uint32_t ospi_periph, uint32_t addrmod, uint32_t addrdtr, uint32_t addrsz, uint32_t addr)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_ADDRMOD | OSPI_WTCFG_ADDRSZ | OSPI_WTCFG_ADDRDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((addrmod & OSPI_WTCFG_ADDRMOD) | (addrsz & OSPI_WTCFG_ADDRSZ) | (addrdtr & OSPI_WTCFG_ADDRDTR));
    OSPI_ADDR(ospi_periph) &= (uint32_t)(~OSPI_ADDR_ADDR);
    OSPI_ADDR(ospi_periph) |= (uint32_t)(addr & OSPI_ADDR_ADDR);
}

/*!
    \brief      configure write alternate bytes mode (API_ID: 0x0045U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  atlemod: OSPI alternate bytes mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_NONE: no alternate bytes mode
      \arg        OSPI_ALTERNATE_BYTES_1_LINE: alternate mode on a single line
      \arg        OSPI_ALTERNATE_BYTES_2_LINES: alternate bytes mode on two lines
      \arg        OSPI_ALTERNATE_BYTES_4_LINES: alternate bytes mode on four lines
      \arg        OSPI_ALTERNATE_BYTES_8_LINES: alternate bytes mode on eight lines
    \param[in]  abdtr: OSPI alternate bytes double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ABDTR_MODE_DISABLE: alternate bytes double transfer rate mode disable
      \arg        OSPI_ABDTR_MODE_ENABLE: alternate bytes double transfer rate mode enable
    \param[in]  altesz: OSPI alternate bytes size
                only one parameter can be selected which is shown as below:
      \arg        OSPI_ALTERNATE_BYTES_8_BITS: alternate bytes size on 8-bit address
      \arg        OSPI_ALTERNATE_BYTES_16_BITS: alternate bytes size on 16-bit address
      \arg        OSPI_ALTERNATE_BYTES_24_BITS: alternate bytes size on 24-bit address
      \arg        OSPI_ALTERNATE_BYTES_32_BITS: alternate bytes size on 32-bit address
    \param[in]  alte: between 0 and 0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void ospi_write_alternate_bytes_config(uint32_t ospi_periph, uint32_t atlemod, uint32_t abdtr, uint32_t altesz, uint32_t alte)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_ALTEMOD | OSPI_WTCFG_ALTESZ | OSPI_WTCFG_ABDTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((atlemod & OSPI_WTCFG_ALTEMOD) | (altesz & OSPI_WTCFG_ALTESZ) | (abdtr & OSPI_WTCFG_ABDTR));
    OSPI_WALTE(ospi_periph) &= (uint32_t)(~OSPI_ALTE_ALTE);
    OSPI_WALTE(ospi_periph) |= (uint32_t)(alte & OSPI_ALTE_ALTE);
}

/*!
    \brief      configure write data mode (API_ID: 0x0046U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  datamod: OSPI data mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DATA_NONE: no data mode
      \arg        OSPI_DATA_1_LINE: data mode on a single line
      \arg        OSPI_DATA_2_LINES: data mode on two lines
      \arg        OSPI_DATA_4_LINES: data mode on four lines
      \arg        OSPI_DATA_8_LINES: data mode on eight lines
    \param[in]  dadtr: OSPI data double transfer rate
                only one parameter can be selected which is shown as below:
      \arg        OSPI_DADTR_MODE_DISABLE: data double transfer rate mode disable
      \arg        OSPI_DADTR_MODE_ENABLE: data double transfer rate mode enable
    \param[out] none
    \retval     none
*/
void ospi_write_data_config(uint32_t ospi_periph, uint32_t datamod, uint32_t dadtr)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)~(OSPI_WTCFG_DATAMOD | OSPI_WTCFG_DADTR);
    OSPI_WTCFG(ospi_periph) |= (uint32_t)((datamod & OSPI_WTCFG_DATAMOD) | (dadtr & OSPI_WTCFG_DADTR));
}

/*!
    \brief      enable OSPI write dqs mode (API_ID: 0x0047U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_dqs_enable(uint32_t ospi_periph)
{
    OSPI_WTCFG(ospi_periph) |= (uint32_t)OSPI_WTCFG_DQSEN;
}

/*!
    \brief      disable OSPI write dqs mode (API_ID: 0x0048U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_dqs_disable(uint32_t ospi_periph)
{
    OSPI_WTCFG(ospi_periph) &= (uint32_t)(~OSPI_WTCFG_DQSEN);
}

/*!
    \brief      configure write dummy cycles number (API_ID: 0x0049U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  dumyc: number of dummy cycles
      \arg        OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
    \param[out] none
    \retval     none
*/
void ospi_write_dummy_cycles_config(uint32_t ospi_periph, uint32_t dumyc)
{
    OSPI_WTIMCFG(ospi_periph) &= (uint32_t)(~OSPI_WTIMCFG_DUMYC);
    OSPI_WTIMCFG(ospi_periph) |= (uint32_t)(dumyc & OSPI_WTIMCFG_DUMYC);
}

/*!
    \brief      hyperbus latency mode (API_ID: 0x004AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  lmod: OSPI latency mode
                only one parameter can be selected which is shown as below:
      \arg        OSPI_VAR_INIT_LATENCY: variable initial latency mode
      \arg        OSPI_FIXED_LATENCY: fixed latency mode
    \param[out] none
    \retval     none
*/
void ospi_latency_mode_config(uint32_t ospi_periph, uint32_t lmod)
{
    OSPI_HBLCFG(ospi_periph) &= (uint32_t)(~OSPI_HBLCFG_LMOD);
    OSPI_HBLCFG(ospi_periph) |= (uint32_t)(lmod & OSPI_HBLCFG_LMOD);
}

/*!
    \brief      enable write zero latency (API_ID: 0x004BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_zero_latency_enable(uint32_t ospi_periph)
{
    OSPI_HBLCFG(ospi_periph) |= (uint32_t)OSPI_HBLCFG_WZLAT;
}

/*!
    \brief      disable write zero latency (API_ID: 0x004CU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     none
*/
void ospi_write_zero_latency_disable(uint32_t ospi_periph)
{
    OSPI_HBLCFG(ospi_periph) &= (uint32_t)(~OSPI_HBLCFG_WZLAT);
}

/*!
    \brief      configure OSPI regular command parameter (API_ID: 0x004DU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  cmd_struct: structure that contains the command configuration information
                            and the member values are shown as below:
      \arg        operation_type: OSPI_OPTYPE_COMMON_CFG, OSPI_OPTYPE_READ_CFG
                                  OSPI_OPTYPE_WRITE_CFG, OSPI_OPTYPE_WRAP_CFG
      \arg        device_id: OSPI_DEVICE0_SELECT, OSPI_DEVICE1_SELECT
      \arg        instruction: between 0 and 0xFFFFFFFF
      \arg        ins_mode: OSPI_INSTRUCTION_NONE, OSPI_INSTRUCTION_1_LINE, OSPI_INSTRUCTION_2_LINES
                            OSPI_INSTRUCTION_4_LINES, OSPI_INSTRUCTION_8_LINES
      \arg        ins_size: OSPI_INSTRUCTION_8_BITS, OSPI_INSTRUCTION_16_BITS
                            OSPI_INSTRUCTION_24_BITS, OSPI_INSTRUCTION_32_BITS
      \arg        ins_dtr_mode: OSPI_INSDTR_MODE_DISABLE, OSPI_INSDTR_MODE_ENABLE
      \arg        address: between 0 and 0xFFFFFFFF
      \arg        addr_mode: OSPI_ADDRESS_NONE, OSPI_ADDRESS_1_LINE, OSPI_ADDRESS_2_LINES
                             OSPI_ADDRESS_4_LINES, OSPI_ADDRESS_8_LINES
      \arg        addr_size: OSPI_ADDRESS_8_BITS, OSPI_ADDRESS_16_BITS
                             OSPI_ADDRESS_24_BITS, OSPI_ADDRESS_32_BITS
      \arg        addr_dtr_mode: OSPI_ADDRDTR_MODE_DISABLE, OSPI_ADDRDTR_MODE_ENABLE
      \arg        alter_bytes: between 0 and 0xFFFFFFFF
      \arg        alter_bytes_mode: OSPI_ALTERNATE_BYTES_NONE, OSPI_ALTERNATE_BYTES_1_LINE
                                    OSPI_ALTERNATE_BYTES_2_LINES, OSPI_ALTERNATE_BYTES_4_LINES
                                    OSPI_ALTERNATE_BYTES_8_LINES
      \arg        alter_bytes_size: OSPI_ALTERNATE_BYTES_8_BITS, OSPI_ALTERNATE_BYTES_16_BITS
                                    OSPI_ALTERNATE_BYTES_24_BITS, OSPI_ALTERNATE_BYTES_32_BITS
      \arg        alter_bytes_dtr_mode: OSPI_ABDTR_MODE_DISABLE, OSPI_ABDTR_MODE_ENABLE
      \arg        data_mode: OSPI_DATA_NONE, OSPI_DATA_1_LINE, OSPI_DATA_2_LINES
                             OSPI_DATA_4_LINES, OSPI_DATA_8_LINES
      \arg        nbdata: between 1 and 0xFFFFFFFF
      \arg        data_dtr_mode: OSPI_DADTR_MODE_DISABLE, OSPI_DADTR_MODE_ENABLE
      \arg        dummy_cycles: OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
      \arg        dqs_mode: OSPI_DQSEN_DISABLE, OSPI_DQSEN_ENABLE
      \arg        sioo_mode: OSPI_SIOO_INST_EVERY_CMD, OSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
*/
void ospi_command_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_regular_cmd_struct *cmd_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004DU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cmd_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((ospi_struct->memory_type != OSPI_HYPERBUS_MEMORY_MODE) || ((cmd_struct->operation_type == OSPI_OPTYPE_WRITE_CFG) ||
                (cmd_struct->operation_type == OSPI_OPTYPE_WRAP_CFG)) || ((cmd_struct->operation_type == OSPI_OPTYPE_READ_CFG)  ||
                        (cmd_struct->operation_type == OSPI_OPTYPE_COMMON_CFG))) {
            /* wait till busy flag is reset */
            while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
            }

            /* configure the registers */
            ospi_config(ospi_periph, ospi_struct, cmd_struct);

            if(cmd_struct->data_mode == OSPI_DATA_NONE) {
                /* when there is no data phase, the transfer start as soon as the configuration is done
                so wait until TC flag is set to go back in idle state */
                while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
                }

                OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;
            }
        }
    }
}

