wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
/*!
    \brief      configure the hyperbus parameters (API_ID: 0x004EU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  hyperbus_cfg_struct: structure containing the hyperbus configuration
                                     and the member values are shown as below:
      \arg        rw_recovery_time: between 0 and 255
      \arg        access_time: between 0 and 255
      \arg        write_zero_latency: OSPI_WRITE_ZERO_LATENCY_DISABLE, OSPI_WRITE_ZERO_LATENCY_ENABLE
      \arg        latency_mode: OSPI_VAR_INIT_LATENCY, OSPI_FIXED_LATENCY
    \param[out] none
    \retval     none
*/
void ospi_hyperbus_config(uint32_t ospi_periph, ospi_hyperbus_cfg_struct *hyperbus_cfg_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(hyperbus_cfg_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* wait till busy flag is reset */
      while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)){
      }

        /* configure hyperbus configuration latency register */
        OSPI_HBLCFG(ospi_periph) &= ~(OSPI_HBLCFG_RWRTM | OSPI_HBLCFG_ACCTM | OSPI_HBLCFG_WZLAT | OSPI_HBLCFG_LMOD);
        OSPI_HBLCFG(ospi_periph) |= OSPI_RWRTM(hyperbus_cfg_struct->rw_recovery_time) | OSPI_ACCTM(hyperbus_cfg_struct->access_time) |
                                   hyperbus_cfg_struct->write_zero_latency | hyperbus_cfg_struct->latency_mode;
    }
}

/*!
    \brief      set the hyperbus command configuration (API_ID: 0x004FU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  hyperbus_cmd_struct: structure containing the hyperbus command
                                     and the member values are shown as below:
      \arg        addr_space: OSPI_MEMORY_ADDRESS_SPACE, OSPI_REGISTER_ADDRESS_SPACE
      \arg        address: between 0 and 0xFFFFFFFF
      \arg        addr_size: OSPI_ADDRESS_8_BITS, OSPI_ADDRESS_16_BITS
      \arg                      OSPI_ADDRESS_24_BITS, OSPI_ADDRESS_32_BITS
      \arg        nbdata: between between 1 and 0xFFFFFFFF
      \arg        dqs_mode: OSPI_DQS_DISABLE, OSPI_DQS_ENABLE
    \param[out] none
    \retval     none
*/
void ospi_hyperbus_cmd_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_hyperbus_cmd_struct *hyperbus_cmd_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004FU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(hyperbus_cmd_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* Check the state of the driver */
        if(ospi_struct->memory_type == OSPI_HYPERBUS_MEMORY_MODE) {
            /* wait till busy flag is reset */
          while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)){
          }

            /* re-initialize the value of the functional mode */
            OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FMOD);

            /* Configure the address space in the DCFG0 register */
            OSPI_DCFG0(ospi_periph) = (OSPI_DCFG0(ospi_periph) & ~OSPI_RESERVE_MODE) | hyperbus_cmd_struct->addr_space;

            /* configure the TCFG and WTCFG registers with the address size and the following configuration :
             - DQS signal enabled (used as RWDS)
             - DTR mode enabled on address and data
             - address and data on 8 lines */
            OSPI_TCFG(ospi_periph) &= ~(OSPI_TCFG_DQSEN | OSPI_TCFG_DADTR | OSPI_TCFG_DATAMOD | OSPI_TCFG_ADDRSZ | 
                                        OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRMOD);
            OSPI_TCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                      hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

            OSPI_WTCFG(ospi_periph) &= ~(OSPI_WTCFG_DQSEN | OSPI_WTCFG_DADTR | OSPI_WTCFG_DATAMOD | OSPI_WTCFG_ADDRSZ | 
                                        OSPI_WTCFG_ADDRDTR | OSPI_WTCFG_ADDRMOD);
            OSPI_WTCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                       hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

