wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
            OSPI_WPTCFG(ospi_periph) &= ~(OSPI_WPTCFG_DQSEN | OSPI_WPTCFG_DADTR | OSPI_WPTCFG_DATAMOD | OSPI_WPTCFG_ADDRSZ | 
                                        OSPI_WPTCFG_ADDRDTR | OSPI_WPTCFG_ADDRMOD);
            OSPI_WPTCFG(ospi_periph) |= hyperbus_cmd_struct->dqs_mode | OSPI_DADTR_MODE_ENABLE | OSPI_DATA_8_LINES |
                                       hyperbus_cmd_struct->addr_size | OSPI_ADDRDTR_MODE_ENABLE | OSPI_ADDRESS_8_LINES;

            /* configure the DTLEN register with the number of data */
            OSPI_DTLEN(ospi_periph) = hyperbus_cmd_struct->nbdata - 1U;

            /* configure the ADDR register with the address value */
            OSPI_ADDR(ospi_periph) = hyperbus_cmd_struct->address;
        }
    }
}

/*!
    \brief      transmit an amount of data in blocking mode (API_ID: 0x0050U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  pdata: pointer to data buffer
    \param[out] none
    \note       this function is used only in indirect write mode
    \retval     none
*/
void ospi_transmit(uint32_t ospi_periph, uint8_t *pdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(pdata)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x004EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t txcounter;
        uint32_t address;
        /* configure counters and size */
        txcounter = OSPI_DTLEN(ospi_periph) + 1U;
        address = (uint32_t)pdata;

        /* configure CTL register with functional mode as indirect write */
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FMOD) | OSPI_INDIRECT_WRITE;

        do {
              /* wait till fifo threshold flag is set to send data */
            while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_FT)) {
            }

            *((__IO uint8_t *)&OSPI_DATA(ospi_periph)) = *(uint8_t *)address;
            address++;
            txcounter--;
        } while(txcounter > 0U);

        /* wait till transfer complete flag is set to go back in idle state */
        while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
        }

        /* clear transfer complete flag */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;
    }
}

/*!
    \brief      receive an amount of data in blocking mode (API_ID: 0x0051U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  pdata: pointer to data buffer
    \param[out] none
    \note       this function is used only in indirect read mode
    \retval     none
*/
void ospi_receive(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, uint8_t *pdata)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0051U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(pdata)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0051U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t rxcounter;
        uint32_t address;
        uint32_t addr_reg = OSPI_ADDR(ospi_periph);
        uint32_t ins_reg = OSPI_INS(ospi_periph);

        /* configure counters and size */
        rxcounter = OSPI_DTLEN(ospi_periph) + 1U;
        address = (uint32_t)pdata;

        /* configure CTL register with functional mode as indirect read */
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_CTL_FMOD) | OSPI_INDIRECT_READ;

        /* trig the transfer by re-writing address or instruction register */
        if(OSPI_HYPERBUS_MEMORY_MODE == ospi_struct->memory_type) {
            OSPI_ADDR(ospi_periph) = addr_reg;
        } else {
            if((OSPI_TCFG(ospi_periph) & OSPI_TCFG_ADDRMOD) != OSPI_ADDRESS_NONE) {
                OSPI_ADDR(ospi_periph) = addr_reg;
            } else {
                OSPI_INS(ospi_periph) = ins_reg;
            }
        }

        do {
            /* wait till fifo threshold or transfer complete flags are set to read received data */
            while(RESET == (OSPI_STAT(ospi_periph) & (OSPI_FLAG_FT | OSPI_FLAG_TC))) {
            }
            *(uint8_t *)address = *((__IO uint8_t *)&OSPI_DATA(ospi_periph));
            address++;
            rxcounter--;
        } while(rxcounter > 0U);

        /* wait till transfer complete flag is set to go back in idle state */
        while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_TC)) {
        }

        /* clear transfer complete flag */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TCC;
    }
}

/*!
    \brief      configure the OSPI automatic polling mode in blocking mode (API_ID: 0x0052U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  autopl_cfg_struct: structure that contains the polling configuration information
                                   and the member values are shown as below:
      \arg        match: between 0 and 0xFFFFFFFF
      \arg        mask: between 0 and 0xFFFFFFFF
      \arg        interval: between 0 and 0xFFFF
      \arg        match_mode: OSPI_MATCH_MODE_AND, OSPI_MATCH_MODE_OR
      \arg        automatic_stop: OSPI_AUTOMATIC_STOP_ABORT, OSPI_AUTOMATIC_STOP_MATCH
    \param[out] none
    \note       this function is used only in automatic polling mode
    \retval     none
*/
void ospi_autopolling_mode(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_autopolling_struct *autopl_cfg_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ospi_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0052U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(autopl_cfg_struct)) {
        fw_debug_report_err(OSPI_MODULE_ID, API_ID(0x0052U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t addr_reg = OSPI_ADDR(ospi_periph);
        uint32_t ins_reg = OSPI_INS(ospi_periph);

        if(autopl_cfg_struct->automatic_stop == OSPI_AUTOMATIC_STOP_MATCH) {
            /* wait till busy flag is reset */
            while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
            }

            /* configure registers */
            OSPI_STATMATCH(ospi_periph) = autopl_cfg_struct->match;
            OSPI_STATMK(ospi_periph) = autopl_cfg_struct->mask;
            OSPI_INTERVAL(ospi_periph) = autopl_cfg_struct->interval;
            OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & (~OSPI_CTL_SPMOD | ~OSPI_CTL_SPS | ~OSPI_CTL_FMOD)) |
                                    (autopl_cfg_struct->match_mode | autopl_cfg_struct->automatic_stop | OSPI_STATUS_POLLING);

            /* trig the transfer by re-writing address or instruction register */
            if(ospi_struct->memory_type == OSPI_HYPERBUS_MEMORY_MODE) {
                OSPI_ADDR(ospi_periph) = addr_reg;
            } else {
                if((OSPI_TCFG(ospi_periph) & OSPI_TCFG_ADDRMOD) != OSPI_ADDRESS_NONE) {
                    OSPI_ADDR(ospi_periph) = addr_reg;
                } else {
                    OSPI_INS(ospi_periph) = ins_reg;
                }
            }

            /* wait till status match flag is set to go back in idle state */
            while(RESET == (OSPI_STAT(ospi_periph) & OSPI_FLAG_SM)) {
            }

            /* clear status match flag */
            OSPI_STATC(ospi_periph) = OSPI_STATC_SMC;
        }
    }
}

/*!
    \brief      configure the OSPI memory mapped mode (API_ID: 0x0053U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  memapped_cfg_struct: structure that contains the memory mapped configuration information
                                     and the member values are shown as below:
                  timeout_activation: OSPI_TIMEOUT_COUNT_DISABLE, OSPI_TIMEOUT_COUNT_ENABLE
                  timeout_period: between 0 and 0xFFFF
    \param[out] none
    \note       this function is used only in memory mapped mode
    \retval     none
*/
void ospi_memorymapped_mode(uint32_t ospi_periph, ospi_memorymapped_struct *memapped_cfg_struct)
{ 
    /* wait till busy flag is reset */
    while(RESET != (OSPI_STAT(ospi_periph) & OSPI_FLAG_BUSY)) {
    }

