wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
    if(memapped_cfg_struct->timeout_activation == OSPI_TIMEOUT_COUNT_ENABLE){
        /* configure register */
        OSPI_LPOUT(ospi_periph) = memapped_cfg_struct->timeout_period;       

        /* clear flags related to interrupt */
        OSPI_STATC(ospi_periph) = OSPI_STATC_TMOUTC;

        /* enable the timeout interrupt */
        OSPI_CTL(ospi_periph) = OSPI_CTL_TMOUTIE;
    }

    /* configure CTL register with functional mode as memory-mapped */
    OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & (~OSPI_CTL_TMOUTEN | ~OSPI_CTL_FMOD)) | 
                            (memapped_cfg_struct->timeout_activation | OSPI_MEMORY_MAPPED);
}

/*!
    \brief      configure the registers for the regular command mode (API_ID: 0x0054U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
      \arg        prescaler: between 0 and 255
      \arg        fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
      \arg        sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
      \arg        device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                               OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
      \arg        cs_hightime: OSPI_CS_HIGH_TIME_1_CYCLE, OSPI_CS_HIGH_TIME_2_CYCLE
                               OSPI_CS_HIGH_TIME_3_CYCLE, OSPI_CS_HIGH_TIME_4_CYCLE
                               OSPI_CS_HIGH_TIME_5_CYCLE, OSPI_CS_HIGH_TIME_6_CYCLE
                               OSPI_CS_HIGH_TIME_7_CYCLE, OSPI_CS_HIGH_TIME_8_CYCLE
      \arg        dual_quad: OSPI_DUAL_QUAD_MODE_DISABLE, OSPI_DUAL_QUAD_MODE_ENABLE
      \arg        memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                                      OSPI_MACRONIX_RAM_MODE, OSPI_HYPERBUS_MEMORY_MODE, OSPI_HYPERBUS_REGISTER_MODE
      \arg        free_clock_run: OSPI_CLOCK_FREE_RUN_DISABLE, OSPI_CLOCK_FREE_RUN_ENABLE
      \arg        delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
      \arg        delay_block_bypass: OSPI_DELAY_CLOCK_BYPASS_DISABLE, OSPI_DELAY_CLOCK_BYPASS_ENABLE
      \arg        refrate: between 0 and 0xFFFFFFFF
    \param[in]  cmd_struct: structure that contains the command configuration information
                            and the member values are shown as below:
      \arg        operation_type: OSPI_OPTYPE_COMMON_CFG, OSPI_OPTYPE_READ_CFG
                                  OSPI_OPTYPE_WRITE_CFG, OSPI_OPTYPE_WRAP_CFG
      \arg        device_id: OSPI_DEVICE0_SELECT, OSPI_DEVICE1_SELECT
      \arg        instruction: between 0 and 0xFFFFFFFF
      \arg        ins_mode: OSPI_INSTRUCTION_NONE, OSPI_INSTRUCTION_1_LINE, OSPI_INSTRUCTION_2_LINES
                            OSPI_INSTRUCTION_4_LINES, OSPI_INSTRUCTION_8_LINES
      \arg        ins_size: OSPI_INSTRUCTION_8_BITS, OSPI_INSTRUCTION_16_BITS
                            OSPI_INSTRUCTION_24_BITS, OSPI_INSTRUCTION_32_BITS
      \arg        ins_dtr_mode: OSPI_INSDTR_MODE_DISABLE, OSPI_INSDTR_MODE_ENABLE
      \arg        address: between 0 and 0xFFFFFFFF
      \arg        addr_mode: OSPI_ADDRESS_NONE, OSPI_ADDRESS_1_LINE, OSPI_ADDRESS_2_LINES
                             OSPI_ADDRESS_4_LINES, OSPI_ADDRESS_8_LINES
      \arg        addr_size: OSPI_ADDRESS_8_BITS, OSPI_ADDRESS_16_BITS
                             OSPI_ADDRESS_24_BITS, OSPI_ADDRESS_32_BITS
      \arg        addr_dtr_mode: OSPI_ADDRDTR_MODE_DISABLE, OSPI_ADDRDTR_MODE_ENABLE
      \arg        alter_bytes: between 0 and 0xFFFFFFFF
      \arg        alter_bytes_mode: OSPI_ALTERNATE_BYTES_NONE, OSPI_ALTERNATE_BYTES_1_LINE
                                    OSPI_ALTERNATE_BYTES_2_LINES, OSPI_ALTERNATE_BYTES_4_LINES
                                    OSPI_ALTERNATE_BYTES_8_LINES
      \arg        alter_bytes_size: OSPI_ALTERNATE_BYTES_8_BITS, OSPI_ALTERNATE_BYTES_16_BITS
                                    OSPI_ALTERNATE_BYTES_24_BITS, OSPI_ALTERNATE_BYTES_32_BITS
      \arg        alter_bytes_dtr_mode: OSPI_ABDTR_MODE_DISABLE, OSPI_ABDTR_MODE_ENABLE
      \arg        data_mode: OSPI_DATA_NONE, OSPI_DATA_1_LINE, OSPI_DATA_2_LINES
                             OSPI_DATA_4_LINES, OSPI_DATA_8_LINES
      \arg        nbdata: between 1 and 0xFFFFFFFF
      \arg        data_dtr_mode: OSPI_DADTR_MODE_DISABLE, OSPI_DADTR_MODE_ENABLE
      \arg        dummy_cycles: OSPI_DUMYC_CYCLES_x (x = 0, 1, 2, ..., 30, 31)
      \arg        dqs_mode: OSPI_DQSEN_DISABLE, OSPI_DQSEN_ENABLE
      \arg        sioo_mode: OSPI_SIOO_INST_EVERY_CMD, OSPI_SIOO_INST_ONLY_FIRST_CMD
    \param[out] none
    \retval     none
*/
static void ospi_config(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, ospi_regular_cmd_struct *cmd_struct)
{
    __IO uint32_t *tcfg_reg, *timcfg_reg, *ins_reg, *alte_reg;

    /* re-initialize the value of the functional mode */
    OSPI_CTL(ospi_periph) &= ~OSPI_CTL_FMOD;

    /* configure the flash ID */
    if(ospi_struct->dual_quad == OSPI_DUAL_QUAD_MODE_DISABLE) {
        OSPI_CTL(ospi_periph) = (OSPI_CTL(ospi_periph) & ~OSPI_DEVICE1_SELECT) | cmd_struct->device_id;
    }

    if(cmd_struct->operation_type == OSPI_OPTYPE_WRITE_CFG) {
        tcfg_reg = &(OSPI_WTCFG(ospi_periph));
        timcfg_reg = &(OSPI_WTIMCFG(ospi_periph));
        ins_reg  = &(OSPI_WINS(ospi_periph));
        alte_reg = &(OSPI_WALTE(ospi_periph));
    } else if(cmd_struct->operation_type == OSPI_OPTYPE_WRAP_CFG) {
        tcfg_reg = &(OSPI_WPTCFG(ospi_periph));
        timcfg_reg = &(OSPI_WPTIMCFG(ospi_periph));
        ins_reg  = &(OSPI_WPINS(ospi_periph));
        alte_reg = &(OSPI_WPALTE(ospi_periph));
    } else {
        tcfg_reg = &(OSPI_TCFG(ospi_periph));
        timcfg_reg = &(OSPI_TIMCFG(ospi_periph));
        ins_reg  = &(OSPI_INS(ospi_periph));
        alte_reg = &(OSPI_ALTE(ospi_periph));
    }

