wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_ospi.c
    if(cmd_struct->alter_bytes_mode != OSPI_ALTERNATE_BYTES_NONE) {
        /* configure the ALTE register with alternate bytes value */
        *alte_reg = cmd_struct->alter_bytes;

        /* configure the TCFG register with alternate bytes communication parameters */
        *tcfg_reg = (*tcfg_reg & ~(OSPI_TCFG_ALTEMOD | OSPI_TCFG_ABDTR | OSPI_TCFG_ALTESZ)) |
                    (cmd_struct->alter_bytes_mode | cmd_struct->alter_bytes_dtr_mode | cmd_struct->alter_bytes_size);
    } else {
        *tcfg_reg = (*tcfg_reg & ~(OSPI_TCFG_ALTEMOD | OSPI_TCFG_ABDTR | OSPI_TCFG_ALTESZ));
    }

    /* configure the TIMCFG register with the number of dummy cycles */
    *timcfg_reg = (*timcfg_reg & ~OSPI_TIMCFG_DUMYC) | cmd_struct->dummy_cycles;

    if(cmd_struct->data_mode != OSPI_DATA_NONE) {
        if(cmd_struct->operation_type == OSPI_OPTYPE_COMMON_CFG) {
            /* configure the DTLEN register with the number of data */
            OSPI_DTLEN(ospi_periph) = (cmd_struct->nbdata - 1U);
        }
    }

    if(cmd_struct->ins_mode != OSPI_INSTRUCTION_NONE) {
        if(cmd_struct->addr_mode != OSPI_ADDRESS_NONE) {
            if(cmd_struct->data_mode != OSPI_DATA_NONE) {
                /* command with instruction, address and data */
                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_IMOD | OSPI_TCFG_INSDTR | OSPI_TCFG_INSSZ |
                               OSPI_TCFG_ADDRMOD | OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRSZ |
                               OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);

                *tcfg_reg |= cmd_struct->ins_mode | cmd_struct->ins_dtr_mode | cmd_struct->ins_size |
                             cmd_struct->addr_mode | cmd_struct->addr_dtr_mode | cmd_struct->addr_size |
                             cmd_struct->data_mode | cmd_struct->data_dtr_mode;
            } else {
                /* command with instruction and address */
                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_IMOD | OSPI_TCFG_INSDTR | OSPI_TCFG_INSSZ |
                               OSPI_TCFG_ADDRMOD | OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRSZ |
                               OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);

                *tcfg_reg |= cmd_struct->ins_mode | cmd_struct->ins_dtr_mode | cmd_struct->ins_size |
                             cmd_struct->addr_mode | cmd_struct->addr_dtr_mode | cmd_struct->addr_size;

                /* the DHQC bit is linked with DDTR bit which should be activated */
                if((ospi_struct->delay_hold_cycle == OSPI_DELAY_HOLD_QUARTER_CYCLE) &&
                        (cmd_struct->ins_dtr_mode == OSPI_INSDTR_MODE_ENABLE)) {
                    *tcfg_reg = (*tcfg_reg & ~OSPI_DADTR_MODE_ENABLE) | OSPI_DADTR_MODE_ENABLE;
                }
            }
            /* configure the TCFG register with DQS and SIOO modes */
            *tcfg_reg &= ~(OSPI_TCFG_DQSEN | OSPI_TCFG_SIOO);
            *tcfg_reg |= (cmd_struct->dqs_mode | cmd_struct->sioo_mode);
            /* configure the INS register with the instruction value */
            *ins_reg = cmd_struct->instruction;

            /* configure the ADDR register with the address value */
            OSPI_ADDR(ospi_periph) = cmd_struct->address;
        } else {
            if(cmd_struct->data_mode != OSPI_DATA_NONE) {
                /* command with instruction and data */
                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_IMOD | OSPI_TCFG_INSDTR | OSPI_TCFG_INSSZ |
                               OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);

                *tcfg_reg = cmd_struct->ins_mode | cmd_struct->ins_dtr_mode | cmd_struct->ins_size |
                            cmd_struct->data_mode | cmd_struct->data_dtr_mode;
            } else {
                /* command with only instruction */
                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_IMOD | OSPI_TCFG_INSDTR | OSPI_TCFG_INSSZ);

                *tcfg_reg = cmd_struct->ins_mode | cmd_struct->ins_dtr_mode | cmd_struct->ins_size;

                /* the DEHQC bit is linked with DDTR bit which should be activated */
                if((ospi_struct->delay_hold_cycle == OSPI_DELAY_HOLD_QUARTER_CYCLE) &&
                        (cmd_struct->ins_dtr_mode == OSPI_INSDTR_MODE_ENABLE)) {
                    *tcfg_reg = (*tcfg_reg & ~OSPI_DADTR_MODE_ENABLE) | OSPI_DADTR_MODE_ENABLE;
                }
            }
            /* configure the TCFG register with DQS and SIOO modes */
            *tcfg_reg |= (cmd_struct->dqs_mode | cmd_struct->sioo_mode);
            /* configure the INS register with the instruction value */
            *ins_reg = cmd_struct->instruction;
        }
    } else {
        if(cmd_struct->addr_mode != OSPI_ADDRESS_NONE) {
            if(cmd_struct->data_mode != OSPI_DATA_NONE) {
                /* command with address and data */
                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_ADDRMOD | OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRSZ |
                               OSPI_TCFG_DATAMOD | OSPI_TCFG_DADTR);

                *tcfg_reg = cmd_struct->addr_mode | cmd_struct->addr_dtr_mode | cmd_struct->addr_size |
                            cmd_struct->data_mode | cmd_struct->data_dtr_mode;
            } else {
                /* command with only address */

                /* configure the TCFG register with all communication parameters */
                *tcfg_reg &= ~(OSPI_TCFG_ADDRMOD | OSPI_TCFG_ADDRDTR | OSPI_TCFG_ADDRSZ);

                *tcfg_reg = cmd_struct->addr_mode | cmd_struct->addr_dtr_mode | cmd_struct->addr_size;
            }
            /* configure the TCFG register with DQS and SIOO modes */
            *tcfg_reg |= (cmd_struct->dqs_mode | cmd_struct->sioo_mode);
            /* configure the ADDR register with the instruction value */
            OSPI_ADDR(ospi_periph) = cmd_struct->address;
        }
    }
}

/*!
    \brief      enable OSPI interrupt (API_ID: 0x0055U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  interrupt: OSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INT_TERR: transfer error interrupt
      \arg        OSPI_INT_TC: transfer complete interrupt
      \arg        OSPI_INT_FT: fifo threshold interrupt
      \arg        OSPI_INT_SM: status match interrupt
      \arg        OSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void ospi_interrupt_enable(uint32_t ospi_periph, uint32_t interrupt)
{
    OSPI_CTL(ospi_periph) |= interrupt;
}

/*!
    \brief      disable OSPI interrupt (API_ID: 0x0056U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  interrupt: OSPI interrupt
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INT_TERR: transfer error interrupt
      \arg        OSPI_INT_TC: transfer complete interrupt
      \arg        OSPI_INT_FT: fifo threshold interrupt
      \arg        OSPI_INT_SM: status match interrupt
      \arg        OSPI_INT_TMOUT: timeout interrupt
    \param[out] none
    \retval     none
*/
void ospi_interrupt_disable(uint32_t ospi_periph, uint32_t interrupt)
{
    OSPI_CTL(ospi_periph) &= ~interrupt;
}

/*!
    \brief      get OSPI fifo level (API_ID: 0x0057U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[out] none
    \retval     6-bit fifo level
*/
uint32_t ospi_fifo_level_get(uint32_t ospi_periph)
{
    uint32_t fl;
    fl = (OSPI_STAT(ospi_periph) & (uint32_t)OSPI_STAT_FL) >> 8U;
    return fl;
}

/*!
    \brief      get OSPI flag status (API_ID: 0x0058U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  flag: OSPI flag status
                only one parameter can be selected which is shown as below:
      \arg        OSPI_FLAG_TERR: transfer error flag
      \arg        OSPI_FLAG_TC: transfer complete flag
      \arg        OSPI_FLAG_FT: fifo threshold flag
      \arg        OSPI_FLAG_SM: status match flag
      \arg        OSPI_FLAG_TMOUT: timeout flag
      \arg        OSPI_FLAG_BUSY: busy flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ospi_flag_get(uint32_t ospi_periph, uint32_t flag)
{
    FlagStatus status;
    if(RESET != (OSPI_STAT(ospi_periph) & flag)) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      clear OSPI flag status (API_ID: 0x0059U)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  flag: OSPI flag status
                only one parameter can be selected which is shown as below:
      \arg        OSPI_FLAG_TERR: transfer error flag
      \arg        OSPI_FLAG_TC: transfer complete flag
      \arg        OSPI_FLAG_SM: status match flag
      \arg        OSPI_FLAG_TMOUT: timeout flag
    \param[out] none
    \retval     none
*/
void ospi_flag_clear(uint32_t ospi_periph, uint32_t flag)
{
    OSPI_STATC(ospi_periph) = (uint32_t)flag;
}

/*!
    \brief      get OSPI interrupt flag status (API_ID: 0x005AU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  interrupt: OSPI interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INT_FLAG_TERR: transmit buffer empty interrupt flag
      \arg        OSPI_INT_FLAG_TC: receive buffer not empty interrupt flag
      \arg        OSPI_INT_FLAG_FT: overrun interrupt flag
      \arg        OSPI_INT_FLAG_SM: config error interrupt flag
      \arg        OSPI_INT_FLAG_TMOUT: CRC error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus ospi_interrupt_flag_get(uint32_t ospi_periph, uint8_t interrupt)
{
    uint32_t reg1 = OSPI_STAT(ospi_periph);
    uint32_t reg2 = OSPI_CTL(ospi_periph);
    FlagStatus status;

    switch(interrupt) {
    /* OSPI transfer error interrupt flag */
    case OSPI_INT_FLAG_TERR:
        reg1 = reg1 & OSPI_STAT_TERR;
        reg2 = reg2 & OSPI_CTL_TERRIE;
        break;
    /* OSPI transfer complete interrupt flag */
    case OSPI_INT_FLAG_TC:
        reg1 = reg1 & OSPI_STAT_TC;
        reg2 = reg2 & OSPI_CTL_TCIE;
        break;
    /* OSPI fifo threshold interrupt flag */
    case OSPI_INT_FLAG_FT:
        reg1 = reg1 & OSPI_STAT_FT;
        reg2 = reg2 & OSPI_CTL_FTIE;
        break;
    /* OSPI status match interrupt flag */
    case OSPI_INT_FLAG_SM:
        reg1 = reg1 & OSPI_STAT_SM;
        reg2 = reg2 & OSPI_CTL_SMIE;
        break;
    /* OSPI timeout interrupt flag */
    case OSPI_INT_FLAG_TMOUT:
        reg1 = reg1 & OSPI_STAT_TMOUT;
        reg2 = reg2 & OSPI_CTL_TMOUTIE;
        break;
    default :
        break;
    }
    /*get OSPI interrupt flag status */
    if(reg1 && reg2) {
        status = SET;
    } else {
        status = RESET;
    }
    return status;
}

/*!
    \brief      clear OSPI interrupt flag status (API_ID: 0x005BU)
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  flag: OSPI interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OSPI_INT_FLAG_TERR: transmit buffer empty interrupt flag
      \arg        OSPI_INT_FLAG_TC: receive buffer not empty interrupt flag
      \arg        OSPI_INT_FLAG_SM: config error interrupt flag
      \arg        OSPI_INT_FLAG_TMOUT: CRC error interrupt flag
    \param[out] none
    \retval     none
*/
void ospi_interrupt_flag_clear(uint32_t ospi_periph, uint32_t flag)
{
    uint32_t reg = OSPI_CTL(ospi_periph);

    switch(flag) {
    /* clear OSPI transfer error interrupt flag */
    case OSPI_INT_FLAG_TERR:
        if(RESET != (reg & OSPI_CTL_TERRIE)) {
            OSPI_STATC(ospi_periph) = (uint32_t)OSPI_STATC_TERRC;
        }
        break;
    /* clear OSPI transfer complete interrupt flag */
    case OSPI_INT_FLAG_TC:
        if(RESET != (reg & OSPI_CTL_TCIE)) {
            OSPI_STATC(ospi_periph) = (uint32_t)OSPI_STATC_TCC;
        }
        break;
    /* clear OSPI status match interrupt flag */
    case OSPI_INT_FLAG_SM:
        if(RESET != (reg & OSPI_CTL_SMIE)) {
            OSPI_STATC(ospi_periph) = (uint32_t)OSPI_STATC_SMC;
        }
        break;
    /* clear OSPI timeout interrupt flag */
    case OSPI_INT_FLAG_TMOUT:
        if(RESET != (reg & OSPI_CTL_TMOUTIE)) {
            OSPI_STATC(ospi_periph) = (uint32_t)OSPI_STATC_TMOUTC;
        }
        break;
    default :
        break;
    }
}
